FreeRTOSHAL/fhal-mach/stm32/vector_m0.c
#include <FreeRTOS.h>
#include "vector.h"
#include "stm32fxxx.h"
void NAKED reset_handler();
void nmi_handler();
void hard_fault_handler();
void bus_fault_handler();
void usage_fault_handler();
void debug_monitor_handler();
void NAKED dummy_handler();

#if defined (STM32F051)
/******  STM32F051  specific Interrupt Numbers *************************************/
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) pvd_irqn(void); /*!< PVD through EXTI Line detect Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC through EXTI Line Interrupt */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Interrupt */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) ts_irqn(void); /*!< Touch sense controller Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_comp_irqn(void); /*!< ADC1, COMP1 and COMP2 Interrupts */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim2_irqn(void); /*!< TIM2 Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 Interrupt */
void WEAK ALIAS(dummy_handler) tim6_dac_irqn(void); /*!< TIM6 and DAC Interrupts */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Interrupt */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 Interrupt */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 Interrupt */
void WEAK ALIAS(dummy_handler) cec_irqn(void); /*!< CEC Interrupt */
#elif defined (STM32F031)
/******  STM32F031 specific Interrupt Numbers *************************************/
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) pvd_irqn(void); /*!< PVD through EXTI Line detect Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC through EXTI Line Interrupt */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Interrupt */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC1 Interrupt */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim2_irqn(void); /*!< TIM2 Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 Interrupt */
#elif defined (STM32F030)
/******  STM32F030 specific Interrupt Numbers *************************************/
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC through EXTI Line Interrupt */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Interrupt */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC1 Interrupt */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Interrupt */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 Interrupt */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 Interrupt */
#elif defined (STM32F072)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) pvd_vddio2_irqn(void); /*!< PVD and VDDIO2 supply comparator through EXTI Line detect Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC through EXTI Line Interrupt */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH Interrupt */
void WEAK ALIAS(dummy_handler) rcc_crs_irqn(void); /*!< RCC and CRS Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) tsc_irqn(void); /*!< TSC Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_6_7_irqn(void); /*!< DMA1 Channel 4, Channel 5, Channel 6 and Channel 7 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_comp_irqn(void); /*!< ADC1, COMP1 and COMP2 Interrupts */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim2_irqn(void); /*!< TIM2 Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 Interrupt */
void WEAK ALIAS(dummy_handler) tim6_dac_irqn(void); /*!< TIM6 and DAC Interrupts */
void WEAK ALIAS(dummy_handler) tim7_irqn(void); /*!< TIM7 Interrupts */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Interrupt */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 Interrupt */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 Interrupt */
void WEAK ALIAS(dummy_handler) usart3_4_irqn(void); /*!< USART3 and USART4 Interrupts */
void WEAK ALIAS(dummy_handler) cec_can_irqn(void); /*!< CEC and CAN Interrupts */
void WEAK ALIAS(dummy_handler) usb_irqn(void); /*!< USB Low Priority global Interrupt */
#elif defined (STM32F042)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) pvd_vddio2_irqn(void); /*!< PVD and VDDIO2 supply comparator through EXTI Line detect Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC through EXTI Line Interrupt */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH Interrupt */
void WEAK ALIAS(dummy_handler) rcc_crs_irqn(void); /*!< RCC and CRS Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) tsc_irqn(void); /*!< TSC Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4, Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC1 Interrupts */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim2_irqn(void); /*!< TIM2 Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 Interrupt */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 Interrupt */
void WEAK ALIAS(dummy_handler) cec_can_irqn(void); /*!< CEC and CAN Interrupts */
void WEAK ALIAS(dummy_handler) usb_irqn(void); /*!< USB Low Priority global Interrupt */
#elif defined (STM32F091)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) pvd_vddio2_irqn(void); /*!< PVD & VDDIO2 Interrupts through EXTI Lines 16 and 31 */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC Interrupt through EXTI Lines 17, 19 and 20 */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH global Interrupt */
void WEAK ALIAS(dummy_handler) rcc_crs_irqn(void); /*!< RCC & CRS Global Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) tsc_irqn(void); /*!< Touch Sensing Controller Interrupts */
void WEAK ALIAS(dummy_handler) dma1_ch1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_ch2_3_dma2_ch1_2_irqn(void); /*!< DMA1 Channel 2 and 3 & DMA2 Channel 1 and 2 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_ch4_7_dma2_ch3_5_irqn(void); /*!< DMA1 Channel 4 to 7 & DMA2 Channel 3 to 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_comp_irqn(void); /*!< ADC, COMP1 and COMP2 Interrupts (EXTI Lines 21 and 22) */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim2_irqn(void); /*!< TIM2 global Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 global Interrupt */
void WEAK ALIAS(dummy_handler) tim6_dac_irqn(void); /*!< TIM6 global and DAC channel underrun error Interrupts */
void WEAK ALIAS(dummy_handler) tim7_irqn(void); /*!< TIM7 global Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 global Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 global Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 global Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 global Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup) */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Event Interrupt & EXTI Line24 Interrupt (I2C2 wakeup) */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 global Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 global Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 global Interrupt & EXTI Line26 Interrupt (USART2 wakeup) */
void WEAK ALIAS(dummy_handler) usart3_8_irqn(void); /*!< USART3 to USART8 global Interrupts */
void WEAK ALIAS(dummy_handler) cec_can_irqn(void); /*!< CEC and CAN global Interrupts & EXTI Line27 Interrupt */
#elif defined (STM32F070xB)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC Interrupt through EXTI Lines 17, 19 and 20 */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH global Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Global Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC1 interrupts (ADC interrupt combined with EXTI Lines 21 and 22 */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 global Interrupt */
void WEAK ALIAS(dummy_handler) tim6_irqn(void); /*!< TIM6 global Interrupts */
void WEAK ALIAS(dummy_handler) tim7_irqn(void); /*!< TIM7 global Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 global Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 global Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 global Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 global Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup) */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Event Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 global Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 global Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 global Interrupt */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 global Interrupt */
void WEAK ALIAS(dummy_handler) usart3_4_irqn(void); /*!< USART3 and USART4 global Interrupts */
void WEAK ALIAS(dummy_handler) usb_irqn(void); /*!< USB global Interrupts & EXTI Line18 Interrupt */
#elif defined (STM32F070x6)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC Interrupt through EXTI Lines 17, 19 and 20 */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH global Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Global Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC1 Interrupt */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 global Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 global Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 global Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 global Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup) */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 global Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 global Interrupt */
void WEAK ALIAS(dummy_handler) usb_irqn(void); /*!< USB global Interrupts & EXTI Line18 Interrupt */
#elif defined (STM32F030xC)
void WEAK ALIAS(dummy_handler) wwdg_irqn(void); /*!< Window WatchDog Interrupt */
void WEAK ALIAS(dummy_handler) rtc_irqn(void); /*!< RTC Interrupt through EXTI Lines 17, 19 and 20 */
void WEAK ALIAS(dummy_handler) flash_irqn(void); /*!< FLASH global Interrupt */
void WEAK ALIAS(dummy_handler) rcc_irqn(void); /*!< RCC Global Interrupts */
void WEAK ALIAS(dummy_handler) exti0_1_irqn(void); /*!< EXTI Line 0 and 1 Interrupts */
void WEAK ALIAS(dummy_handler) exti2_3_irqn(void); /*!< EXTI Line 2 and 3 Interrupts */
void WEAK ALIAS(dummy_handler) exti4_15_irqn(void); /*!< EXTI Line 4 to 15 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel1_irqn(void); /*!< DMA1 Channel 1 Interrupt */
void WEAK ALIAS(dummy_handler) dma1_channel2_3_irqn(void); /*!< DMA1 Channel 2 and Channel 3 Interrupts */
void WEAK ALIAS(dummy_handler) dma1_channel4_5_irqn(void); /*!< DMA1 Channel 4 and Channel 5 Interrupts */
void WEAK ALIAS(dummy_handler) adc1_irqn(void); /*!< ADC Interrupts */
void WEAK ALIAS(dummy_handler) tim1_brk_up_trg_com_irqn(void); /*!< TIM1 Break, Update, Trigger and Commutation Interrupts */
void WEAK ALIAS(dummy_handler) tim1_cc_irqn(void); /*!< TIM1 Capture Compare Interrupt */
void WEAK ALIAS(dummy_handler) tim3_irqn(void); /*!< TIM3 global Interrupt */
void WEAK ALIAS(dummy_handler) tim6_irqn(void); /*!< TIM6 global Interrupts */
void WEAK ALIAS(dummy_handler) tim7_irqn(void); /*!< TIM7 global Interrupt */
void WEAK ALIAS(dummy_handler) tim14_irqn(void); /*!< TIM14 global Interrupt */
void WEAK ALIAS(dummy_handler) tim15_irqn(void); /*!< TIM15 global Interrupt */
void WEAK ALIAS(dummy_handler) tim16_irqn(void); /*!< TIM16 global Interrupt */
void WEAK ALIAS(dummy_handler) tim17_irqn(void); /*!< TIM17 global Interrupt */
void WEAK ALIAS(dummy_handler) i2c1_irqn(void); /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup) */
void WEAK ALIAS(dummy_handler) i2c2_irqn(void); /*!< I2C2 Event Interrupt */
void WEAK ALIAS(dummy_handler) spi1_irqn(void); /*!< SPI1 global Interrupt */
void WEAK ALIAS(dummy_handler) spi2_irqn(void); /*!< SPI2 global Interrupt */
void WEAK ALIAS(dummy_handler) usart1_irqn(void); /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
void WEAK ALIAS(dummy_handler) usart2_irqn(void); /*!< USART2 global Interrupt & EXTI Line26 Interrupt (USART2 wakeup) */
void WEAK ALIAS(dummy_handler) usart3_6_irqn(void); /*!< USART3 to USART6 global Interrupts */
#endif /* STM32F051 */
extern void xPortPendSVHandler( void ) __attribute__ (( naked ));
extern void xPortSysTickHandler( void );
extern void vPortSVCHandler( void ) __attribute__ (( naked ));
extern void _end_stack(void);

